# FlipFromToRoom Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..FlipFromToRoom Method
FamilyInstance Class See Also
---
Flips the settings of "From Room" and "To Room" for the door or window instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void FlipFromToRoom()
```

Visual Basic
---
```text
Public Sub FlipFromToRoom
```

Visual C++
---
```text
public:
void FlipFromToRoom()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the FamilyInstance is neither a door nor a window. |

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace